#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_app.coreapi-app will be created
  + resource "digitalocean_app" "coreapi-app" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_url             = (known after apply)
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + spec {
          + domains = (known after apply)
          + name    = "coreapi-app"
          + region  = "nyc1"

          + database {
              + engine     = "PG"
              + name       = "coreapi"
              + production = false
            }

          + domain {
              + name     = (known after apply)
              + type     = (known after apply)
              + wildcard = (known after apply)
              + zone     = (known after apply)
            }

          + service {
              + http_port      = 8080
              + instance_count = 1
              + name           = "coreapi-app-service"
              + run_command    = (known after apply)

              + image {
                  + registry      = "travistrle"
                  + registry_type = "DOCKER_HUB"
                  + repository    = "core-api"
                  + tag           = "latest"

                  + deploy_on_push {
                      + enabled = (known after apply)
                    }
                }

              + routes {
                  + path                 = (known after apply)
                  + preserve_path_prefix = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @travistrle, Action: `pull_request`*